MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18325/mcu.h
extern volatile SSP2BUFbits_t SSP2BUFbits __at(0x219);
// bitfield macros
#define _SSP2BUF_SSP2BUF0_POSN                              0x0
#define _SSP2BUF_SSP2BUF0_POSITION                          0x0
#define _SSP2BUF_SSP2BUF0_SIZE                              0x1
#define _SSP2BUF_SSP2BUF0_LENGTH                            0x1
#define _SSP2BUF_SSP2BUF0_MASK                              0x1
#define _SSP2BUF_SSP2BUF1_POSN                              0x1
#define _SSP2BUF_SSP2BUF1_POSITION                          0x1
#define _SSP2BUF_SSP2BUF1_SIZE                              0x1
#define _SSP2BUF_SSP2BUF1_LENGTH                            0x1
#define _SSP2BUF_SSP2BUF1_MASK                              0x2
#define _SSP2BUF_SSP2BUF2_POSN                              0x2
#define _SSP2BUF_SSP2BUF2_POSITION                          0x2
#define _SSP2BUF_SSP2BUF2_SIZE                              0x1
#define _SSP2BUF_SSP2BUF2_LENGTH                            0x1
#define _SSP2BUF_SSP2BUF2_MASK                              0x4
#define _SSP2BUF_SSP2BUF3_POSN                              0x3
#define _SSP2BUF_SSP2BUF3_POSITION                          0x3
#define _SSP2BUF_SSP2BUF3_SIZE                              0x1
#define _SSP2BUF_SSP2BUF3_LENGTH                            0x1
#define _SSP2BUF_SSP2BUF3_MASK                              0x8
#define _SSP2BUF_SSP2BUF4_POSN                              0x4
#define _SSP2BUF_SSP2BUF4_POSITION                          0x4
#define _SSP2BUF_SSP2BUF4_SIZE                              0x1
#define _SSP2BUF_SSP2BUF4_LENGTH                            0x1
#define _SSP2BUF_SSP2BUF4_MASK                              0x10
#define _SSP2BUF_SSP2BUF5_POSN                              0x5
#define _SSP2BUF_SSP2BUF5_POSITION                          0x5
#define _SSP2BUF_SSP2BUF5_SIZE                              0x1
#define _SSP2BUF_SSP2BUF5_LENGTH                            0x1
#define _SSP2BUF_SSP2BUF5_MASK                              0x20
#define _SSP2BUF_SSP2BUF6_POSN                              0x6
#define _SSP2BUF_SSP2BUF6_POSITION                          0x6
#define _SSP2BUF_SSP2BUF6_SIZE                              0x1
#define _SSP2BUF_SSP2BUF6_LENGTH                            0x1
#define _SSP2BUF_SSP2BUF6_MASK                              0x40
#define _SSP2BUF_SSP2BUF7_POSN                              0x7
#define _SSP2BUF_SSP2BUF7_POSITION                          0x7
#define _SSP2BUF_SSP2BUF7_SIZE                              0x1
#define _SSP2BUF_SSP2BUF7_LENGTH                            0x1
#define _SSP2BUF_SSP2BUF7_MASK                              0x80
#define _SSP2BUF_BUF_POSN                                   0x0
#define _SSP2BUF_BUF_POSITION                               0x0
#define _SSP2BUF_BUF_SIZE                                   0x8
#define _SSP2BUF_BUF_LENGTH                                 0x8
#define _SSP2BUF_BUF_MASK                                   0xFF
#define _SSP2BUF_BUF0_POSN                                  0x0
#define _SSP2BUF_BUF0_POSITION                              0x0
#define _SSP2BUF_BUF0_SIZE                                  0x1
#define _SSP2BUF_BUF0_LENGTH                                0x1
#define _SSP2BUF_BUF0_MASK                                  0x1
#define _SSP2BUF_BUF1_POSN                                  0x1
#define _SSP2BUF_BUF1_POSITION                              0x1
#define _SSP2BUF_BUF1_SIZE                                  0x1
#define _SSP2BUF_BUF1_LENGTH                                0x1
#define _SSP2BUF_BUF1_MASK                                  0x2
#define _SSP2BUF_BUF2_POSN                                  0x2
#define _SSP2BUF_BUF2_POSITION                              0x2
#define _SSP2BUF_BUF2_SIZE                                  0x1
#define _SSP2BUF_BUF2_LENGTH                                0x1
#define _SSP2BUF_BUF2_MASK                                  0x4
#define _SSP2BUF_BUF3_POSN                                  0x3
#define _SSP2BUF_BUF3_POSITION                              0x3
#define _SSP2BUF_BUF3_SIZE                                  0x1
#define _SSP2BUF_BUF3_LENGTH                                0x1
#define _SSP2BUF_BUF3_MASK                                  0x8
#define _SSP2BUF_BUF4_POSN                                  0x4
#define _SSP2BUF_BUF4_POSITION                              0x4
#define _SSP2BUF_BUF4_SIZE                                  0x1
#define _SSP2BUF_BUF4_LENGTH                                0x1
#define _SSP2BUF_BUF4_MASK                                  0x10
#define _SSP2BUF_BUF5_POSN                                  0x5
#define _SSP2BUF_BUF5_POSITION                              0x5
#define _SSP2BUF_BUF5_SIZE                                  0x1
#define _SSP2BUF_BUF5_LENGTH                                0x1
#define _SSP2BUF_BUF5_MASK                                  0x20
#define _SSP2BUF_BUF6_POSN                                  0x6
#define _SSP2BUF_BUF6_POSITION                              0x6
#define _SSP2BUF_BUF6_SIZE                                  0x1
#define _SSP2BUF_BUF6_LENGTH                                0x1
#define _SSP2BUF_BUF6_MASK                                  0x40
#define _SSP2BUF_BUF7_POSN                                  0x7
#define _SSP2BUF_BUF7_POSITION                              0x7
#define _SSP2BUF_BUF7_SIZE                                  0x1
#define _SSP2BUF_BUF7_LENGTH                                0x1
#define _SSP2BUF_BUF7_MASK                                  0x80
#define _SSP2BUF_SSP2BUF_POSN                               0x0
#define _SSP2BUF_SSP2BUF_POSITION                           0x0
#define _SSP2BUF_SSP2BUF_SIZE                               0x8
#define _SSP2BUF_SSP2BUF_LENGTH                             0x8
#define _SSP2BUF_SSP2BUF_MASK                               0xFF

// Register: SSP2ADD
#define SSP2ADD SSP2ADD
extern volatile unsigned char           SSP2ADD             __at(0x21A);
#ifndef _LIB_BUILD
asm("SSP2ADD equ 021Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP2ADD0               :1;
        unsigned SSP2ADD1               :1;
        unsigned SSP2ADD2               :1;
        unsigned SSP2ADD3               :1;
        unsigned SSP2ADD4               :1;
        unsigned SSP2ADD5               :1;
        unsigned SSP2ADD6               :1;
        unsigned SSP2ADD7               :1;
    };
    struct {
        unsigned ADD                    :8;
    };
    struct {
        unsigned ADD0                   :1;
        unsigned ADD1                   :1;
        unsigned ADD2                   :1;
        unsigned ADD3                   :1;
        unsigned ADD4                   :1;
        unsigned ADD5                   :1;
        unsigned ADD6                   :1;
        unsigned ADD7                   :1;
    };
    struct {
        unsigned SSP2ADD                :8;
    };
} SSP2ADDbits_t;
extern volatile SSP2ADDbits_t SSP2ADDbits __at(0x21A);
// bitfield macros
#define _SSP2ADD_SSP2ADD0_POSN                              0x0
#define _SSP2ADD_SSP2ADD0_POSITION                          0x0
#define _SSP2ADD_SSP2ADD0_SIZE                              0x1
#define _SSP2ADD_SSP2ADD0_LENGTH                            0x1
#define _SSP2ADD_SSP2ADD0_MASK                              0x1
#define _SSP2ADD_SSP2ADD1_POSN                              0x1
#define _SSP2ADD_SSP2ADD1_POSITION                          0x1
#define _SSP2ADD_SSP2ADD1_SIZE                              0x1
#define _SSP2ADD_SSP2ADD1_LENGTH                            0x1
#define _SSP2ADD_SSP2ADD1_MASK                              0x2
#define _SSP2ADD_SSP2ADD2_POSN                              0x2
#define _SSP2ADD_SSP2ADD2_POSITION                          0x2
#define _SSP2ADD_SSP2ADD2_SIZE                              0x1
#define _SSP2ADD_SSP2ADD2_LENGTH                            0x1
#define _SSP2ADD_SSP2ADD2_MASK                              0x4
#define _SSP2ADD_SSP2ADD3_POSN                              0x3
#define _SSP2ADD_SSP2ADD3_POSITION                          0x3
#define _SSP2ADD_SSP2ADD3_SIZE                              0x1
#define _SSP2ADD_SSP2ADD3_LENGTH                            0x1
#define _SSP2ADD_SSP2ADD3_MASK                              0x8
#define _SSP2ADD_SSP2ADD4_POSN                              0x4
#define _SSP2ADD_SSP2ADD4_POSITION                          0x4
#define _SSP2ADD_SSP2ADD4_SIZE                              0x1
#define _SSP2ADD_SSP2ADD4_LENGTH                            0x1
#define _SSP2ADD_SSP2ADD4_MASK                              0x10
#define _SSP2ADD_SSP2ADD5_POSN                              0x5
#define _SSP2ADD_SSP2ADD5_POSITION                          0x5
#define _SSP2ADD_SSP2ADD5_SIZE                              0x1
#define _SSP2ADD_SSP2ADD5_LENGTH                            0x1
#define _SSP2ADD_SSP2ADD5_MASK                              0x20
#define _SSP2ADD_SSP2ADD6_POSN                              0x6
#define _SSP2ADD_SSP2ADD6_POSITION                          0x6
#define _SSP2ADD_SSP2ADD6_SIZE                              0x1
#define _SSP2ADD_SSP2ADD6_LENGTH                            0x1
#define _SSP2ADD_SSP2ADD6_MASK                              0x40
#define _SSP2ADD_SSP2ADD7_POSN                              0x7
#define _SSP2ADD_SSP2ADD7_POSITION                          0x7
#define _SSP2ADD_SSP2ADD7_SIZE                              0x1
#define _SSP2ADD_SSP2ADD7_LENGTH                            0x1
#define _SSP2ADD_SSP2ADD7_MASK                              0x80
#define _SSP2ADD_ADD_POSN                                   0x0
#define _SSP2ADD_ADD_POSITION                               0x0
#define _SSP2ADD_ADD_SIZE                                   0x8
#define _SSP2ADD_ADD_LENGTH                                 0x8
#define _SSP2ADD_ADD_MASK                                   0xFF
#define _SSP2ADD_ADD0_POSN                                  0x0
#define _SSP2ADD_ADD0_POSITION                              0x0
#define _SSP2ADD_ADD0_SIZE                                  0x1
#define _SSP2ADD_ADD0_LENGTH                                0x1
#define _SSP2ADD_ADD0_MASK                                  0x1
#define _SSP2ADD_ADD1_POSN                                  0x1
#define _SSP2ADD_ADD1_POSITION                              0x1
#define _SSP2ADD_ADD1_SIZE                                  0x1
#define _SSP2ADD_ADD1_LENGTH                                0x1
#define _SSP2ADD_ADD1_MASK                                  0x2
#define _SSP2ADD_ADD2_POSN                                  0x2
#define _SSP2ADD_ADD2_POSITION                              0x2
#define _SSP2ADD_ADD2_SIZE                                  0x1
#define _SSP2ADD_ADD2_LENGTH                                0x1
#define _SSP2ADD_ADD2_MASK                                  0x4
#define _SSP2ADD_ADD3_POSN                                  0x3
#define _SSP2ADD_ADD3_POSITION                              0x3
#define _SSP2ADD_ADD3_SIZE                                  0x1
#define _SSP2ADD_ADD3_LENGTH                                0x1
#define _SSP2ADD_ADD3_MASK                                  0x8
#define _SSP2ADD_ADD4_POSN                                  0x4
#define _SSP2ADD_ADD4_POSITION                              0x4
#define _SSP2ADD_ADD4_SIZE                                  0x1
#define _SSP2ADD_ADD4_LENGTH                                0x1
#define _SSP2ADD_ADD4_MASK                                  0x10
#define _SSP2ADD_ADD5_POSN                                  0x5
#define _SSP2ADD_ADD5_POSITION                              0x5
#define _SSP2ADD_ADD5_SIZE                                  0x1
#define _SSP2ADD_ADD5_LENGTH                                0x1
#define _SSP2ADD_ADD5_MASK                                  0x20
#define _SSP2ADD_ADD6_POSN                                  0x6
#define _SSP2ADD_ADD6_POSITION                              0x6
#define _SSP2ADD_ADD6_SIZE                                  0x1
#define _SSP2ADD_ADD6_LENGTH                                0x1
#define _SSP2ADD_ADD6_MASK                                  0x40
#define _SSP2ADD_ADD7_POSN                                  0x7
#define _SSP2ADD_ADD7_POSITION                              0x7
#define _SSP2ADD_ADD7_SIZE                                  0x1
#define _SSP2ADD_ADD7_LENGTH                                0x1
#define _SSP2ADD_ADD7_MASK                                  0x80
#define _SSP2ADD_SSP2ADD_POSN                               0x0
#define _SSP2ADD_SSP2ADD_POSITION                           0x0
#define _SSP2ADD_SSP2ADD_SIZE                               0x8
#define _SSP2ADD_SSP2ADD_LENGTH                             0x8
#define _SSP2ADD_SSP2ADD_MASK                               0xFF

