MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18325/mcu.h
extern volatile __bit                   MDCIN1PPS1          __at(0x70D1);	// @ (0xE1A * 8 + 1)
#define                                 MDCIN1PPS1_bit      _BIT_ACCESS(MDCIN1PPS,1)
// MDCIN1PPS<MDCIN1PPS2>
extern volatile __bit                   MDCIN1PPS2          __at(0x70D2);	// @ (0xE1A * 8 + 2)
#define                                 MDCIN1PPS2_bit      _BIT_ACCESS(MDCIN1PPS,2)
// MDCIN1PPS<MDCIN1PPS3>
extern volatile __bit                   MDCIN1PPS3          __at(0x70D3);	// @ (0xE1A * 8 + 3)
#define                                 MDCIN1PPS3_bit      _BIT_ACCESS(MDCIN1PPS,3)
// MDCIN1PPS<MDCIN1PPS4>
extern volatile __bit                   MDCIN1PPS4          __at(0x70D4);	// @ (0xE1A * 8 + 4)
#define                                 MDCIN1PPS4_bit      _BIT_ACCESS(MDCIN1PPS,4)
// MDCIN2PPS<MDCIN2PPS0>
extern volatile __bit                   MDCIN2PPS0          __at(0x70D8);	// @ (0xE1B * 8 + 0)
#define                                 MDCIN2PPS0_bit      _BIT_ACCESS(MDCIN2PPS,0)
// MDCIN2PPS<MDCIN2PPS1>
extern volatile __bit                   MDCIN2PPS1          __at(0x70D9);	// @ (0xE1B * 8 + 1)
#define                                 MDCIN2PPS1_bit      _BIT_ACCESS(MDCIN2PPS,1)
// MDCIN2PPS<MDCIN2PPS2>
extern volatile __bit                   MDCIN2PPS2          __at(0x70DA);	// @ (0xE1B * 8 + 2)
#define                                 MDCIN2PPS2_bit      _BIT_ACCESS(MDCIN2PPS,2)
// MDCIN2PPS<MDCIN2PPS3>
extern volatile __bit                   MDCIN2PPS3          __at(0x70DB);	// @ (0xE1B * 8 + 3)
#define                                 MDCIN2PPS3_bit      _BIT_ACCESS(MDCIN2PPS,3)
// MDCIN2PPS<MDCIN2PPS4>
extern volatile __bit                   MDCIN2PPS4          __at(0x70DC);	// @ (0xE1B * 8 + 4)
#define                                 MDCIN2PPS4_bit      _BIT_ACCESS(MDCIN2PPS,4)
// MDCARL<MDCL0>
extern volatile __bit                   MDCL0               __at(0x1CF8);	// @ (0x39F * 8 + 0)
#define                                 MDCL0_bit           _BIT_ACCESS(MDCARL,0)
// MDCARL<MDCL1>
extern volatile __bit                   MDCL1               __at(0x1CF9);	// @ (0x39F * 8 + 1)
#define                                 MDCL1_bit           _BIT_ACCESS(MDCARL,1)
// MDCARL<MDCL2>
extern volatile __bit                   MDCL2               __at(0x1CFA);	// @ (0x39F * 8 + 2)
#define                                 MDCL2_bit           _BIT_ACCESS(MDCARL,2)
// MDCARL<MDCL3>
extern volatile __bit                   MDCL3               __at(0x1CFB);	// @ (0x39F * 8 + 3)
#define                                 MDCL3_bit           _BIT_ACCESS(MDCARL,3)
// MDCARL<MDCLPOL>
extern volatile __bit                   MDCLPOL             __at(0x1CFE);	// @ (0x39F * 8 + 6)
#define                                 MDCLPOL_bit         _BIT_ACCESS(MDCARL,6)
// MDCARL<MDCLSYNC>
extern volatile __bit                   MDCLSYNC            __at(0x1CFD);	// @ (0x39F * 8 + 5)
#define                                 MDCLSYNC_bit        _BIT_ACCESS(MDCARL,5)
// MDCON<MDEN>
extern volatile __bit                   MDEN                __at(0x1CE7);	// @ (0x39C * 8 + 7)
#define                                 MDEN_bit            _BIT_ACCESS(MDCON,7)
// MDMINPPS<MDMINPPS0>
extern volatile __bit                   MDMINPPS0           __at(0x70E0);	// @ (0xE1C * 8 + 0)
#define                                 MDMINPPS0_bit       _BIT_ACCESS(MDMINPPS,0)
// MDMINPPS<MDMINPPS1>
extern volatile __bit                   MDMINPPS1           __at(0x70E1);	// @ (0xE1C * 8 + 1)
#define                                 MDMINPPS1_bit       _BIT_ACCESS(MDMINPPS,1)
// MDMINPPS<MDMINPPS2>
extern volatile __bit                   MDMINPPS2           __at(0x70E2);	// @ (0xE1C * 8 + 2)
#define                                 MDMINPPS2_bit       _BIT_ACCESS(MDMINPPS,2)
// MDMINPPS<MDMINPPS3>
extern volatile __bit                   MDMINPPS3           __at(0x70E3);	// @ (0xE1C * 8 + 3)
#define                                 MDMINPPS3_bit       _BIT_ACCESS(MDMINPPS,3)
// MDMINPPS<MDMINPPS4>
extern volatile __bit                   MDMINPPS4           __at(0x70E4);	// @ (0xE1C * 8 + 4)
#define                                 MDMINPPS4_bit       _BIT_ACCESS(MDMINPPS,4)
// MDSRC<MDMS0>
extern volatile __bit                   MDMS0               __at(0x1CE8);	// @ (0x39D * 8 + 0)
#define                                 MDMS0_bit           _BIT_ACCESS(MDSRC,0)
// MDSRC<MDMS1>
extern volatile __bit                   MDMS1               __at(0x1CE9);	// @ (0x39D * 8 + 1)
#define                                 MDMS1_bit           _BIT_ACCESS(MDSRC,1)
// MDSRC<MDMS2>
extern volatile __bit                   MDMS2               __at(0x1CEA);	// @ (0x39D * 8 + 2)
#define                                 MDMS2_bit           _BIT_ACCESS(MDSRC,2)
// MDSRC<MDMS3>
extern volatile __bit                   MDMS3               __at(0x1CEB);	// @ (0x39D * 8 + 3)
#define                                 MDMS3_bit           _BIT_ACCESS(MDSRC,3)
// MDCON<MDOPOL>
extern volatile __bit                   MDOPOL              __at(0x1CE4);	// @ (0x39C * 8 + 4)
#define                                 MDOPOL_bit          _BIT_ACCESS(MDCON,4)
// MDCON<MDOUT>
extern volatile __bit                   MDOUT               __at(0x1CE3);	// @ (0x39C * 8 + 3)
#define                                 MDOUT_bit           _BIT_ACCESS(MDCON,3)
// CLCDATA<MLC1OUT>
extern volatile __bit                   MLC1OUT             __at(0x7878);	// @ (0xF0F * 8 + 0)
#define                                 MLC1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// CLCDATA<MLC2OUT>
extern volatile __bit                   MLC2OUT             __at(0x7879);	// @ (0xF0F * 8 + 1)
#define                                 MLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// CLCDATA<MLC3OUT>
extern volatile __bit                   MLC3OUT             __at(0x787A);	// @ (0xF0F * 8 + 2)
#define                                 MLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// CLCDATA<MLC4OUT>
extern volatile __bit                   MLC4OUT             __at(0x787B);	// @ (0xF0F * 8 + 3)
#define                                 MLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// PMD4<MSSP1MD>
extern volatile __bit                   MSSP1MD             __at(0x48A9);	// @ (0x915 * 8 + 1)
#define                                 MSSP1MD_bit         _BIT_ACCESS(PMD4,1)
// PMD4<MSSP2MD>
extern volatile __bit                   MSSP2MD             __at(0x48AA);	// @ (0x915 * 8 + 2)
#define                                 MSSP2MD_bit         _BIT_ACCESS(PMD4,2)
// NCO1CON<N1EN>
extern volatile __bit                   N1EN                __at(0x24F7);	// @ (0x49E * 8 + 7)
#define                                 N1EN_bit            _BIT_ACCESS(NCO1CON,7)
// NCO1CON<N1OUT>
extern volatile __bit                   N1OUT               __at(0x24F5);	// @ (0x49E * 8 + 5)
#define                                 N1OUT_bit           _BIT_ACCESS(NCO1CON,5)
// NCO1CON<N1PFM>
extern volatile __bit                   N1PFM               __at(0x24F0);	// @ (0x49E * 8 + 0)
#define                                 N1PFM_bit           _BIT_ACCESS(NCO1CON,0)
// NCO1CON<N1POL>
extern volatile __bit                   N1POL               __at(0x24F4);	// @ (0x49E * 8 + 4)
#define                                 N1POL_bit           _BIT_ACCESS(NCO1CON,4)
// PIE2<NCO1IE>
extern volatile __bit                   NCO1IE              __at(0x490);	// @ (0x92 * 8 + 0)
#define                                 NCO1IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<NCO1IF>
extern volatile __bit                   NCO1IF              __at(0x90);	// @ (0x12 * 8 + 0)
#define                                 NCO1IF_bit          _BIT_ACCESS(PIR2,0)
// PMD1<NCOMD>
extern volatile __bit                   NCOMD               __at(0x4897);	// @ (0x912 * 8 + 7)
#define                                 NCOMD_bit           _BIT_ACCESS(PMD1,7)
// OSCCON1<NDIV0>
extern volatile __bit                   NDIV0               __at(0x48C8);	// @ (0x919 * 8 + 0)
#define                                 NDIV0_bit           _BIT_ACCESS(OSCCON1,0)
// OSCCON1<NDIV1>
extern volatile __bit                   NDIV1               __at(0x48C9);	// @ (0x919 * 8 + 1)
#define                                 NDIV1_bit           _BIT_ACCESS(OSCCON1,1)
// OSCCON1<NDIV2>
extern volatile __bit                   NDIV2               __at(0x48CA);	// @ (0x919 * 8 + 2)
#define                                 NDIV2_bit           _BIT_ACCESS(OSCCON1,2)
// OSCCON1<NDIV3>
extern volatile __bit                   NDIV3               __at(0x48CB);	// @ (0x919 * 8 + 3)
#define                                 NDIV3_bit           _BIT_ACCESS(OSCCON1,3)
// OSCCON1<NOSC0>
extern volatile __bit                   NOSC0               __at(0x48CC);	// @ (0x919 * 8 + 4)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON1,4)
// OSCCON1<NOSC1>
extern volatile __bit                   NOSC1               __at(0x48CD);	// @ (0x919 * 8 + 5)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON1,5)
// OSCCON1<NOSC2>
extern volatile __bit                   NOSC2               __at(0x48CE);	// @ (0x919 * 8 + 6)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON1,6)
// OSCCON3<NOSCR>
extern volatile __bit                   NOSCR               __at(0x48DB);	// @ (0x91B * 8 + 3)
#define                                 NOSCR_bit           _BIT_ACCESS(OSCCON3,3)
// NVMADRL<NVMADR0>
extern volatile __bit                   NVMADR0             __at(0x4488);	// @ (0x891 * 8 + 0)
#define                                 NVMADR0_bit         _BIT_ACCESS(NVMADRL,0)
// NVMADRL<NVMADR1>
extern volatile __bit                   NVMADR1             __at(0x4489);	// @ (0x891 * 8 + 1)
#define                                 NVMADR1_bit         _BIT_ACCESS(NVMADRL,1)
// NVMADRH<NVMADR10>
extern volatile __bit                   NVMADR10            __at(0x4492);	// @ (0x892 * 8 + 2)
#define                                 NVMADR10_bit        _BIT_ACCESS(NVMADRH,2)
// NVMADRH<NVMADR11>
extern volatile __bit                   NVMADR11            __at(0x4493);	// @ (0x892 * 8 + 3)
#define                                 NVMADR11_bit        _BIT_ACCESS(NVMADRH,3)
// NVMADRH<NVMADR12>
extern volatile __bit                   NVMADR12            __at(0x4494);	// @ (0x892 * 8 + 4)
#define                                 NVMADR12_bit        _BIT_ACCESS(NVMADRH,4)
// NVMADRH<NVMADR13>
extern volatile __bit                   NVMADR13            __at(0x4495);	// @ (0x892 * 8 + 5)
#define                                 NVMADR13_bit        _BIT_ACCESS(NVMADRH,5)
// NVMADRH<NVMADR14>
extern volatile __bit                   NVMADR14            __at(0x4496);	// @ (0x892 * 8 + 6)
#define                                 NVMADR14_bit        _BIT_ACCESS(NVMADRH,6)
// NVMADRL<NVMADR2>
extern volatile __bit                   NVMADR2             __at(0x448A);	// @ (0x891 * 8 + 2)
#define                                 NVMADR2_bit         _BIT_ACCESS(NVMADRL,2)
// NVMADRL<NVMADR3>
extern volatile __bit                   NVMADR3             __at(0x448B);	// @ (0x891 * 8 + 3)
#define                                 NVMADR3_bit         _BIT_ACCESS(NVMADRL,3)
// NVMADRL<NVMADR4>
extern volatile __bit                   NVMADR4             __at(0x448C);	// @ (0x891 * 8 + 4)
#define                                 NVMADR4_bit         _BIT_ACCESS(NVMADRL,4)
// NVMADRL<NVMADR5>
extern volatile __bit                   NVMADR5             __at(0x448D);	// @ (0x891 * 8 + 5)
#define                                 NVMADR5_bit         _BIT_ACCESS(NVMADRL,5)
// NVMADRL<NVMADR6>
extern volatile __bit                   NVMADR6             __at(0x448E);	// @ (0x891 * 8 + 6)
#define                                 NVMADR6_bit         _BIT_ACCESS(NVMADRL,6)
// NVMADRL<NVMADR7>
extern volatile __bit                   NVMADR7             __at(0x448F);	// @ (0x891 * 8 + 7)
#define                                 NVMADR7_bit         _BIT_ACCESS(NVMADRL,7)
// NVMADRH<NVMADR8>
extern volatile __bit                   NVMADR8             __at(0x4490);	// @ (0x892 * 8 + 0)
#define                                 NVMADR8_bit         _BIT_ACCESS(NVMADRH,0)
// NVMADRH<NVMADR9>
extern volatile __bit                   NVMADR9             __at(0x4491);	// @ (0x892 * 8 + 1)
#define                                 NVMADR9_bit         _BIT_ACCESS(NVMADRH,1)
// NVMDATL<NVMDAT0>
extern volatile __bit                   NVMDAT0             __at(0x4498);	// @ (0x893 * 8 + 0)
#define                                 NVMDAT0_bit         _BIT_ACCESS(NVMDATL,0)
// NVMDATL<NVMDAT1>
extern volatile __bit                   NVMDAT1             __at(0x4499);	// @ (0x893 * 8 + 1)
#define                                 NVMDAT1_bit         _BIT_ACCESS(NVMDATL,1)
// NVMDATH<NVMDAT10>
extern volatile __bit                   NVMDAT10            __at(0x44A2);	// @ (0x894 * 8 + 2)
#define                                 NVMDAT10_bit        _BIT_ACCESS(NVMDATH,2)
// NVMDATH<NVMDAT11>
extern volatile __bit                   NVMDAT11            __at(0x44A3);	// @ (0x894 * 8 + 3)
#define                                 NVMDAT11_bit        _BIT_ACCESS(NVMDATH,3)
// NVMDATH<NVMDAT12>
extern volatile __bit                   NVMDAT12            __at(0x44A4);	// @ (0x894 * 8 + 4)
#define                                 NVMDAT12_bit        _BIT_ACCESS(NVMDATH,4)
// NVMDATH<NVMDAT13>
extern volatile __bit                   NVMDAT13            __at(0x44A5);	// @ (0x894 * 8 + 5)
#define                                 NVMDAT13_bit        _BIT_ACCESS(NVMDATH,5)
// NVMDATL<NVMDAT2>
extern volatile __bit                   NVMDAT2             __at(0x449A);	// @ (0x893 * 8 + 2)
#define                                 NVMDAT2_bit         _BIT_ACCESS(NVMDATL,2)
// NVMDATL<NVMDAT3>
extern volatile __bit                   NVMDAT3             __at(0x449B);	// @ (0x893 * 8 + 3)
#define                                 NVMDAT3_bit         _BIT_ACCESS(NVMDATL,3)
// NVMDATL<NVMDAT4>
extern volatile __bit                   NVMDAT4             __at(0x449C);	// @ (0x893 * 8 + 4)
#define                                 NVMDAT4_bit         _BIT_ACCESS(NVMDATL,4)
// NVMDATL<NVMDAT5>
extern volatile __bit                   NVMDAT5             __at(0x449D);	// @ (0x893 * 8 + 5)
#define                                 NVMDAT5_bit         _BIT_ACCESS(NVMDATL,5)
// NVMDATL<NVMDAT6>
extern volatile __bit                   NVMDAT6             __at(0x449E);	// @ (0x893 * 8 + 6)
#define                                 NVMDAT6_bit         _BIT_ACCESS(NVMDATL,6)
// NVMDATL<NVMDAT7>
extern volatile __bit                   NVMDAT7             __at(0x449F);	// @ (0x893 * 8 + 7)
#define                                 NVMDAT7_bit         _BIT_ACCESS(NVMDATL,7)
// NVMDATH<NVMDAT8>
extern volatile __bit                   NVMDAT8             __at(0x44A0);	// @ (0x894 * 8 + 0)
#define                                 NVMDAT8_bit         _BIT_ACCESS(NVMDATH,0)
// NVMDATH<NVMDAT9>
extern volatile __bit                   NVMDAT9             __at(0x44A1);	// @ (0x894 * 8 + 1)
#define                                 NVMDAT9_bit         _BIT_ACCESS(NVMDATH,1)
// PIE2<NVMIE>
extern volatile __bit                   NVMIE               __at(0x494);	// @ (0x92 * 8 + 4)
#define                                 NVMIE_bit           _BIT_ACCESS(PIE2,4)
// PIR2<NVMIF>
extern volatile __bit                   NVMIF               __at(0x94);	// @ (0x12 * 8 + 4)
#define                                 NVMIF_bit           _BIT_ACCESS(PIR2,4)
// PMD0<NVMMD>
extern volatile __bit                   NVMMD               __at(0x488A);	// @ (0x911 * 8 + 2)
#define                                 NVMMD_bit           _BIT_ACCESS(PMD0,2)
// NVMCON1<NVMREGS>
extern volatile __bit                   NVMREGS             __at(0x44AE);	// @ (0x895 * 8 + 6)
#define                                 NVMREGS_bit         _BIT_ACCESS(NVMCON1,6)
// ODCONA<ODCA0>
extern volatile __bit                   ODCA0               __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 ODCA0_bit           _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 ODCA1_bit           _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 ODCA2_bit           _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// RC1STA<OERR>
extern volatile __bit                   OERR                __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RC1STA,1)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x48DC);	// @ (0x91B * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// PIE3<OSFIE>
extern volatile __bit                   OSFIE               __at(0x49F);	// @ (0x93 * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE3,7)
// PIR3<OSFIF>
extern volatile __bit                   OSFIF               __at(0x9F);	// @ (0x13 * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR3,7)
// PWMTMRS<P5TSEL0>
extern volatile __bit                   P5TSEL0             __at(0x30F8);	// @ (0x61F * 8 + 0)
#define                                 P5TSEL0_bit         _BIT_ACCESS(PWMTMRS,0)
// PWMTMRS<P5TSEL1>
extern volatile __bit                   P5TSEL1             __at(0x30F9);	// @ (0x61F * 8 + 1)
#define                                 P5TSEL1_bit         _BIT_ACCESS(PWMTMRS,1)
// PWMTMRS<P6TSEL0>
extern volatile __bit                   P6TSEL0             __at(0x30FA);	// @ (0x61F * 8 + 2)
#define                                 P6TSEL0_bit         _BIT_ACCESS(PWMTMRS,2)
// PWMTMRS<P6TSEL1>
extern volatile __bit                   P6TSEL1             __at(0x30FB);	// @ (0x61F * 8 + 3)
#define                                 P6TSEL1_bit         _BIT_ACCESS(PWMTMRS,3)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// OSCSTAT1<PLLR>
extern volatile __bit                   PLLR                __at(0x48E0);	// @ (0x91C * 8 + 0)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT1,0)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x7078);	// @ (0xE0F * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// PWM5DCH<PWM5DCH0>
extern volatile __bit                   PWM5DCH0            __at(0x30C0);	// @ (0x618 * 8 + 0)
#define                                 PWM5DCH0_bit        _BIT_ACCESS(PWM5DCH,0)
// PWM5DCH<PWM5DCH1>
extern volatile __bit                   PWM5DCH1            __at(0x30C1);	// @ (0x618 * 8 + 1)
#define                                 PWM5DCH1_bit        _BIT_ACCESS(PWM5DCH,1)
// PWM5DCH<PWM5DCH2>
extern volatile __bit                   PWM5DCH2            __at(0x30C2);	// @ (0x618 * 8 + 2)
#define                                 PWM5DCH2_bit        _BIT_ACCESS(PWM5DCH,2)
// PWM5DCH<PWM5DCH3>
extern volatile __bit                   PWM5DCH3            __at(0x30C3);	// @ (0x618 * 8 + 3)
#define                                 PWM5DCH3_bit        _BIT_ACCESS(PWM5DCH,3)
// PWM5DCH<PWM5DCH4>
extern volatile __bit                   PWM5DCH4            __at(0x30C4);	// @ (0x618 * 8 + 4)
#define                                 PWM5DCH4_bit        _BIT_ACCESS(PWM5DCH,4)
// PWM5DCH<PWM5DCH5>
extern volatile __bit                   PWM5DCH5            __at(0x30C5);	// @ (0x618 * 8 + 5)
#define                                 PWM5DCH5_bit        _BIT_ACCESS(PWM5DCH,5)
// PWM5DCH<PWM5DCH6>
extern volatile __bit                   PWM5DCH6            __at(0x30C6);	// @ (0x618 * 8 + 6)
#define                                 PWM5DCH6_bit        _BIT_ACCESS(PWM5DCH,6)
// PWM5DCH<PWM5DCH7>
extern volatile __bit                   PWM5DCH7            __at(0x30C7);	// @ (0x618 * 8 + 7)
#define                                 PWM5DCH7_bit        _BIT_ACCESS(PWM5DCH,7)
// PWM5DCL<PWM5DCL0>
extern volatile __bit                   PWM5DCL0            __at(0x30BE);	// @ (0x617 * 8 + 6)
#define                                 PWM5DCL0_bit        _BIT_ACCESS(PWM5DCL,6)
// PWM5DCL<PWM5DCL1>
extern volatile __bit                   PWM5DCL1            __at(0x30BF);	// @ (0x617 * 8 + 7)
#define                                 PWM5DCL1_bit        _BIT_ACCESS(PWM5DCL,7)
// PWM5CON<PWM5EN>
extern volatile __bit                   PWM5EN              __at(0x30CF);	// @ (0x619 * 8 + 7)
#define                                 PWM5EN_bit          _BIT_ACCESS(PWM5CON,7)
// PMD3<PWM5MD>
extern volatile __bit                   PWM5MD              __at(0x48A4);	// @ (0x914 * 8 + 4)
#define                                 PWM5MD_bit          _BIT_ACCESS(PMD3,4)
// PWM5CON<PWM5OUT>
extern volatile __bit                   PWM5OUT             __at(0x30CD);	// @ (0x619 * 8 + 5)
#define                                 PWM5OUT_bit         _BIT_ACCESS(PWM5CON,5)
// PWM5CON<PWM5POL>
extern volatile __bit                   PWM5POL             __at(0x30CC);	// @ (0x619 * 8 + 4)
#define                                 PWM5POL_bit         _BIT_ACCESS(PWM5CON,4)
// PWM6DCH<PWM6DCH0>
extern volatile __bit                   PWM6DCH0            __at(0x30D8);	// @ (0x61B * 8 + 0)
#define                                 PWM6DCH0_bit        _BIT_ACCESS(PWM6DCH,0)
// PWM6DCH<PWM6DCH1>
extern volatile __bit                   PWM6DCH1            __at(0x30D9);	// @ (0x61B * 8 + 1)
#define                                 PWM6DCH1_bit        _BIT_ACCESS(PWM6DCH,1)
// PWM6DCH<PWM6DCH2>
extern volatile __bit                   PWM6DCH2            __at(0x30DA);	// @ (0x61B * 8 + 2)
#define                                 PWM6DCH2_bit        _BIT_ACCESS(PWM6DCH,2)
// PWM6DCH<PWM6DCH3>
extern volatile __bit                   PWM6DCH3            __at(0x30DB);	// @ (0x61B * 8 + 3)
#define                                 PWM6DCH3_bit        _BIT_ACCESS(PWM6DCH,3)
// PWM6DCH<PWM6DCH4>
extern volatile __bit                   PWM6DCH4            __at(0x30DC);	// @ (0x61B * 8 + 4)
#define                                 PWM6DCH4_bit        _BIT_ACCESS(PWM6DCH,4)
